stress.yml
config:
  target: 'http://localhost:3003'
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: 'start lunch time'
    - duration: 120
      arrivalRate: 5
      name: 'during lunch time'
    - duration: 60
      arrivalRate: 5
      rampTo: 10
      name: 'start dinner time'
    - duration: 120
      arrivalRate: 10
      name: 'during dinner time'
    - duration: 60
      arrivalRate: 10
      rampTo: 1
      name: 'after dinner time'

  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'

scenarios:
    - flow:
        - loop:
            - get:
                url: "/restaurant/{{$randomNumber(1, 10000)}}/overview"
          count: 100