stress.yml
config:
  target: 'http://localhost:3003'
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: 'warm up the application'
    - duration: 120
      arrivalRate: 100
      name: 'sustained big load'
    - duration: 60
      arrivalRate: 100
      rampTo: 50
      name: calming down 
    - duration: 120
      arrivalRate: 50
      name: 'staying calm'
    - duration: 60
      arrivalRate: 50
      rampTo: 300
      name: 'ready for dinner time'
    - duration: 60
      arrivalRate: 300
      name: 'during dinner'
    - duration : 60
      arrivalRate: 300
      rampTo: 10
      name: 'dinner done'
    - duration : 60
      arrivalRate: 10
      name: 'sleep'

  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
    - get:
        url: "/restaurant/{{$randomNumber(1,9999842)}}/overview"